//
// Created by 我的名字是Ox on 2023/12/27 027.
//
/*新冠肺炎疫情期间,湖北某县三月份每天新增确诊人数存储在数组 a 中,其中 a[0]是至 2 月 29 日确诊总人数,a[i]
是 3 月份第 i 天的新増确诊人数,计算并输出 3 月 1~31 日该县每天确诊总人数的序列(要求用循环实现)。*/
# include<stdio.h >
int main()
{
    int a[32] = {578,58,57,59,55,51,58,45,52,45,41,48,43,49,42,40,49,35,33,33,30,39,31,32,26,29,36,15,19,19,18,14};
    int i;
    int sum=578;
/*由此开始设计程序*/
    printf("3月份每天确诊总人数列表\n");
    for (i = 1; i <= 31; i++)
    {
        sum += a[i];
        printf("3月%d日确诊总人数为%d\n",i,sum);

    }

    return 0;
}

